system/dpd/src/lib/API/Client/logs/ac0419d0790418b4195babe2c3681dc4.logs

LOCATION: 
http://ws.dpd.ru:80/services/calculator2
REQUEST : 
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://dpd.ru/ws/calculator/2012-03-20"><SOAP-ENV:Body><ns1:getServiceCost2><request><auth><clientNumber>1113003408</clientNumber><clientKey>8BAAC80931B124BF3815B9C6FBE83AB7F4774716</clientKey></auth><pickup><cityId>1033210055</cityId><cityName>Алматы</cityName><regionCode>0</regionCode><countryCode>KZ</countryCode></pickup><delivery><cityId>195851969</cityId><cityName>Петропавловск-Камчатский</cityName><regionCode>0</regionCode><countryCode>RU</countryCode></delivery><selfPickup>false</selfPickup><selfDelivery>false</selfDelivery><weight>1</weight><volume>0.001</volume><declaredValue>0</declaredValue></request></ns1:getServiceCost2></SOAP-ENV:Body></SOAP-ENV:Envelope>

ANSWER  : 
<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:getServiceCost2Response xmlns:ns2="http://dpd.ru/ws/calculator/2012-03-20"><return><serviceCode>CUR</serviceCode><serviceName>DPD CLASSIC</serviceName><cost>7245.0</cost><days>7</days></return><return><serviceCode>CSM</serviceCode><serviceName>DPD Online Express</serviceName><cost>2750.0</cost><days>7</days></return><return><serviceCode>PCL</serviceCode><serviceName>DPD OPTIMUM</serviceName><cost>2800.0</cost><days>29</days></return><return><serviceCode>ECU</serviceCode><serviceName>DPD ECONOMY CU</serviceName><cost>11442.5</cost><days>39</days></return></ns2:getServiceCost2Response></S:Body></S:Envelope>
