local/modules/yauheni.dpd/sdk/src/lib/API/Client/logs/ac0419d0790418b4195babe2c3681dc4.logs

LOCATION: 
http://ws.dpd.ru:80/services/calculator2
REQUEST : 
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://dpd.ru/ws/calculator/2012-03-20"><SOAP-ENV:Body><ns1:getServiceCost2><request><auth><clientNumber>1104009121</clientNumber><clientKey>CA461909F1DFED320BFBCA5B90A002AD5756D6BF</clientKey></auth><pickup><cityId>3427842768</cityId><cityName>Щомыслица</cityName><regionCode>0</regionCode><countryCode>BY</countryCode></pickup><delivery><cityId>543760155</cityId><cityName>Гомель</cityName><regionCode>0</regionCode><countryCode>BY</countryCode></delivery><selfPickup>false</selfPickup><selfDelivery>false</selfDelivery><weight>1</weight><volume>0.004</volume><declaredValue>85.19</declaredValue></request></ns1:getServiceCost2></SOAP-ENV:Body></SOAP-ENV:Envelope>

ANSWER  : 
<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:getServiceCost2Response xmlns:ns2="http://dpd.ru/ws/calculator/2012-03-20"><return><serviceCode>NDY</serviceCode><serviceName>DPD EXPRESS</serviceName><cost>9.34</cost><days>1</days></return><return><serviceCode>CSM</serviceCode><serviceName>DPD Online Express</serviceName><cost>9.34</cost><days>1</days></return></ns2:getServiceCost2Response></S:Body></S:Envelope>
