src/lib/API/Client/logs/43b3d53fe765e0a61dd8c2172cbea1ce.logs

LOCATION: 
http://wstest.dpd.ru:80/services/calculator2
REQUEST : 
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://dpd.ru/ws/calculator/2012-03-20"><SOAP-ENV:Body><ns1:getServiceCost2><request><auth><clientNumber>1001027795</clientNumber><clientKey>182A17BD6FC5557D1FCA30FA1D56593EB21AEF88</clientKey></auth><pickup><cityId>49694102</cityId><cityName>Москва</cityName><regionCode>0</regionCode><countryCode>RU</countryCode></pickup><delivery><cityId>195902175</cityId><cityName>Тула</cityName><regionCode>0</regionCode><countryCode>RU</countryCode></delivery><selfPickup>true</selfPickup><selfDelivery>true</selfDelivery><weight>3</weight><volume>0.012</volume><declaredValue>3000</declaredValue></request></ns1:getServiceCost2></SOAP-ENV:Body></SOAP-ENV:Envelope>

ANSWER  : 
<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:getServiceCost2Response xmlns:ns2="http://dpd.ru/ws/calculator/2012-03-20"><return><serviceCode>NDY</serviceCode><serviceName>DPD EXPRESS</serviceName><cost>1543.07</cost><days>1</days></return><return><serviceCode>BZP</serviceCode><serviceName>DPD 18:00</serviceName><cost>906.57</cost><days>1</days></return><return><serviceCode>CUR</serviceCode><serviceName>DPD CLASSIC domestic</serviceName><cost>1119.05</cost><days>1</days></return><return><serviceCode>ECN</serviceCode><serviceName>DPD ECONOMY</serviceName><cost>711.43</cost><days>2</days></return><return><serviceCode>CSM</serviceCode><serviceName>DPD Online Express</serviceName><cost>285.56</cost><days>1</days></return><return><serviceCode>PCL</serviceCode><serviceName>DPD Online Classic</serviceName><cost>273.76</cost><days>1</days></return><return><serviceCode>PUP</serviceCode><serviceName>DPD Shop to Shop</serviceName><cost>313.16</cost><days>1</days></return></ns2:getServiceCost2Response></S:Body></S:Envelope>
